Revit 2027 API
BuiltInFailures.ColorFillFailures.SymtemColorFillLegendNotAllowed Property
 [Category name] Color Fill Legend can only be placed in a Floor Plan View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SymtemColorFillLegendNotAllowed { get; }
Public Shared ReadOnly Property SymtemColorFillLegendNotAllowed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SymtemColorFillLegendNotAllowed {
	FailureDefinitionId^ get ();
}
static member SymtemColorFillLegendNotAllowed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColorFillFailures Class
Autodesk.Revit.DB Namespace